1.Import the necessary libraries

In [1]:
import pandas as pd

In [4]:
import pandas as pd
url = 'https://raw.githubusercontent.com/justmarkham/DAT8/master/data/u.user'
users=pd.read_csv(url)
print(users)

    user_id|age|gender|occupation|zip_code
0                  1|24|M|technician|85711
1                       2|53|F|other|94043
2                      3|23|M|writer|32067
3                  4|24|M|technician|43537
4                       5|33|F|other|15213
..                                     ...
938                 939|26|F|student|33319
939           940|32|M|administrator|02215
940                 941|20|M|student|97229
941               942|48|F|librarian|78209
942                 943|22|M|student|77841

[943 rows x 1 columns]

2.Assign it to a variable called users and use the 'user_id' as index

In [5]:
import pandas as pd
users=pd.read_csv(url,sep="|",index_col="user_id")
users

         age gender     occupation zip_code
user_id
1         24      M     technician    85711
2         53      F          other    94043
3         23      M         writer    32067
4         24      M     technician    43537
5         33      F          other    15213
...      ...    ...            ...      ...
939       26      F        student    33319
940       32      M  administrator    02215
941       20      M        student    97229
942       48      F      librarian    78209
943       22      M        student    77841

[943 rows x 4 columns]

3.See the first 10 and last 10 entries

In [6]:
import pandas as pd
print(users.head(10))
print(users.tail(10))

         age gender     occupation zip_code
user_id
1         24      M     technician    85711
2         53      F          other    94043
3         23      M         writer    32067
4         24      M     technician    43537
5         33      F          other    15213
6         42      M      executive    98101
7         57      M  administrator    91344
8         36      M  administrator    05201
9         29      M        student    01002
10        53      M         lawyer    90703
         age gender     occupation zip_code
user_id
934       61      M       engineer    22902
935       42      M         doctor    66221
936       24      M          other    32789
937       48      M       educator    98072
938       38      F     technician    55038
939       26      F        student    33319
940       32      M  administrator    02215
941       20      M        student    97229
942       48      F      librarian    78209
943       22      M        student    77841

4.What is the number of observations in the dataset?

In [7]:
import pandas as pd
users.shape[0]

943

5.What is the number of columns in the dataset?

In [8]:
import pandas as pd
users.shape[1]

4

6.Print the name of all the columns.

In [9]:
import pandas as pd
users.columns

Index(['age', 'gender', 'occupation', 'zip_code'], dtype='object')

7.How is the dataset indexed?

In [10]:
import pandas as pd
users.index

Int64Index([  1,   2,   3,   4,   5,   6,   7,   8,   9,  10,
            ...
            934, 935, 936, 937, 938, 939, 940, 941, 942, 943],
           dtype='int64', name='user_id', length=943)

8.What is the data type of each column?

In [11]:
import pandas as pd
users.dtypes

age            int64
gender        object
occupation    object
zip_code      object
dtype: object

9.Print only the occupation column

In [12]:
import pandas as pd
users["occupation"]

user_id
1         technician
2              other
3             writer
4         technician
5              other
           ...
939          student
940    administrator
941          student
942        librarian
943          student
Name: occupation, Length: 943, dtype: object

10.How many different occupations are in this dataset?

In [14]:
import pandas as pd
users["occupation"].value_counts().count()

21

11.What is the most frequent occupation?

In [15]:
import pandas as pd
users["occupation"].value_counts().sort_values(ascending=False).head()

student          196
other            105
educator          95
administrator     79
engineer          67
Name: occupation, dtype: int64

12.DataFrame Info.

In [16]:
import pandas as pd
users.describe()

              age
count  943.000000
mean    34.051962
std     12.192740
min      7.000000
25%     25.000000
50%     31.000000
75%     43.000000
max     73.000000

13.Describe all the columns

In [17]:
import pandas as pd
users.describe(include="all")

               age gender occupation zip_code
count   943.000000    943        943      943
unique         NaN      2         21      795
top            NaN      M    student    55414
freq           NaN    670        196        9
mean     34.051962    NaN        NaN      NaN
std      12.192740    NaN        NaN      NaN
min       7.000000    NaN        NaN      NaN
25%      25.000000    NaN        NaN      NaN
50%      31.000000    NaN        NaN      NaN
75%      43.000000    NaN        NaN      NaN
max      73.000000    NaN        NaN      NaN

14.Summarize only the occupation column

In [18]:
import pandas as pd
users.occupation.describe()

count         943
unique         21
top       student
freq          196
Name: occupation, dtype: object

15.What is the mean age of users?

In [19]:
import pandas as pd
users.age.mean()

34.05196182396607

16.What is the age with least occurrence?

In [21]:
import pandas as pd
users.age.value_counts().tail()

7     1
66    1
11    1
10    1
73    1
Name: age, dtype: int64